Autodesk.Revit.DB.BuiltInFailures.GridFailures.GridlineAxisTooFar
Axis of gridlines should not be further than [Value] to each other.

Autodesk.Revit.DB.BuiltInFailures.GridFailures.GridlineAxisTooClose
Axis of gridlines should not change order or be closer than [Value] to each other.

Autodesk.Revit.DB.BuiltInFailures.GridFailures.GridInGridChainCannotMirror
A grid that is a sub-grid of a multi-segment grid can only be mirrored if the entire multi-segment grid is being mirrored.

Autodesk.Revit.DB.BuiltInFailures.GridFailures.GridEndSegmentsLengthTooShort
The end segment length for a grid must be at least [Length Value]

Autodesk.Revit.DB.BuiltInFailures.GridFailures
Failures about Grid.